const test = require('ava');
const {omerSefira, omerTodayIs, omerEmoji} = require('../dist/cjs/omer');

test('sefira', t => {
  t.is(omerSefira(46, 'en'), 'Eternity within Majesty');
  t.is(omerSefira(46, 'he'), 'נֶּֽצַח שֶׁבְּמַּלְכוּת');
  t.is(omerSefira(46, 'translit'), "Netzach sheb'Malkhut");
});

test('omerTodayIsEn', t => {
  t.is(omerTodayIs(1, 'en'), 'Today is 1 day of the Omer');
  t.is(omerTodayIs(2, 'en'), 'Today is 2 days of the Omer');
  t.is(omerTodayIs(7, 'en'), 'Today is 7 days, which is 1 week of the Omer');
  t.is(
    omerTodayIs(8, 'en'),
    'Today is 8 days, which is 1 week and 1 day of the Omer'
  );
  t.is(
    omerTodayIs(13, 'en'),
    'Today is 13 days, which is 1 week and 6 days of the Omer'
  );
  t.is(omerTodayIs(14, 'en'), 'Today is 14 days, which is 2 weeks of the Omer');
  t.is(
    omerTodayIs(41, 'en'),
    'Today is 41 days, which is 5 weeks and 6 days of the Omer'
  );
  t.is(
    omerTodayIs(46, 'en'),
    'Today is 46 days, which is 6 weeks and 4 days of the Omer'
  );
});

test('throws-invalid-day', t => {
  const error = t.throws(
    () => {
      console.log(omerTodayIs(123, 'he'));
    },
    {instanceOf: RangeError}
  );
  t.is(error.message, 'Invalid Omer day 123');
});

test('omerTodayIsHe', t => {
  const actual = [];
  for (let i = 1; i <= 49; i++) {
    actual.push(omerTodayIs(i, 'he'));
  }
  const expected = [
    'הַיּוֹם יוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם שְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם חֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁבְעָה יָמִים, שְׁהֵם שָׁבֽוּעַ אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם שְׁמוֹנָה יָמִים, שְׁהֵם שָׁבֽוּעַ אֶחָד וְיוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם תִּשְׁעָה יָמִים, שְׁהֵם שָׁבֽוּעַ אֶחָד וּשְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם עֲשָׂרָה יָמִים, שְׁהֵם שָׁבֽוּעַ אֶחָד וּשְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אֶחָד עָשָׂר יוֹם, שְׁהֵם שָׁבֽוּעַ אֶחָד וְאַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁנַיִם עָשָׂר יוֹם, שְׁהֵם שָׁבֽוּעַ אֶחָד וַחֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁלוֹשָׁה עָשָׂר יוֹם, שְׁהֵם שָׁבֽוּעַ אֶחָד וְשִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אַרְבָּעָה עָשָׂר יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת לָעֽוֹמֶר',
    'הַיּוֹם חֲמִשָּׁה עָשָׂר יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם שִׁשָּׁה עָשָׂר יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁבְעָה עָשָׂר יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁמוֹנָה עָשָׂר יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם תִּשְׁעָה עָשָׂר יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם עֶשְׂרִים יוֹם, שְׁהֵם שְׁנֵי שָׁבוּעוֹת וְשִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אֶחָד וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת לָעֽוֹמֶר',
    'הַיּוֹם שְׁנַיִם וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם שְׁלוֹשָׁה וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אַרְבָּעָה וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת וּשְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם חֲמִשָּׁה וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁשָּׁה וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁבְעָה וְעֶשְׂרִים יוֹם, שְׁהֵם שְׁלוֹשָׁה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁמוֹנָה וְעֶשְׂרִים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת לָעֽוֹמֶר',
    'הַיּוֹם תִּשְׁעָה וְעֶשְׂרִים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם שְׁלוֹשִׁים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אֶחָד וּשְׁלוֹשִׁים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁנַיִם וּשְׁלוֹשִׁים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁלוֹשָׁה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אַרְבָּעָה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם חֲמִשָּׁה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת לָעֽוֹמֶר',
    'הַיּוֹם שִׁשָּׁה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם שִׁבְעָה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁמוֹנָה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וּשְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם תִּשְׁעָה וּשְׁלוֹשִׁים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אַרְבָּעִים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם אֶחָד וְאַרְבָּעִים יוֹם, שְׁהֵם חֲמִשָּׁה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת לָעֽוֹמֶר',
    'הַיּוֹם שְׁלוֹשָׁה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעֽוֹמֶר',
    'הַיּוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעֽוֹמֶר',
    'הַיּוֹם חֲמִשָּׁה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת וּשְׁלוֹשָׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁשָּׁה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שִׁבְעָה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת וַחֲמִשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁשָּׁה שָׁבוּעוֹת וְשִׁשָּׁה יָמִים לָעֽוֹמֶר',
    'הַיּוֹם תִּשְׁעָה וְאַרְבָּעִים יוֹם, שְׁהֵם שִׁבְעָה שָׁבוּעוֹת לָעֽוֹמֶר',
  ];
  t.deepEqual(actual, expected);
});

test('emoji', t => {
  const actual = [];
  for (let i = 1; i <= 49; i++) {
    const str = omerEmoji(i);
    actual.push(str);
  }
  const expected = [
    '①',
    '②',
    '③',
    '④',
    '⑤',
    '⑥',
    '⑦',
    '⑧',
    '⑨',
    '⑩',
    '⑪',
    '⑫',
    '⑬',
    '⑭',
    '⑮',
    '⑯',
    '⑰',
    '⑱',
    '⑲',
    '⑳',
    '㉑',
    '㉒',
    '㉓',
    '㉔',
    '㉕',
    '㉖',
    '㉗',
    '㉘',
    '㉙',
    '㉚',
    '㉛',
    '㉜',
    '㉝',
    '㉞',
    '㉟',
    '㊱',
    '㊲',
    '㊳',
    '㊴',
    '㊵',
    '㊶',
    '㊷',
    '㊸',
    '㊹',
    '㊺',
    '㊻',
    '㊼',
    '㊽',
    '㊾',
  ];
  t.deepEqual(actual, expected);
});
